In [5]:
import json

import nltk
import numpy as np
import pandas as pd
import tensorflow as tf
import tensorflow_hub as hub
import tensorflow_text as text

In [6]:
class schema:
    def __init__ (self, id):
        self.id = id
        self.tableNames = []

In [9]:
# Loading Spider Data
with open('./spider-data/tables.json', 'r') as f:
  schemaDoc = json.load(f)

with open('./spider-data/train_spider.json', 'r') as f:
  queryDoc = json.load(f)

schemas = {}

for idx, iSchema in enumerate(schemaDoc):
    dbid = iSchema['db_id']
    test = schema(dbid)
    for columnName in iSchema['table_names_original']:
        test.tableNames.append(columnName)
    print("Schema", idx, ":", test.id, ":", test.tableNames)
    schemas[dbid] = test

tables = []
nl_queries = []

for idx, iquery in enumerate(queryDoc):
   # Initialize a blank array with the length of the number of tables
   tablesArray = [0] * len(schemas[iquery['db_id']].tableNames)
   # Get all the tokens from teh particular query we are looking at
   queryTokens = iquery['query_toks']

   # Search through all the tokens in the given query
   for idx, queryToken in enumerate(queryTokens):
      # Only look at tokens that come after the word "from," since those are the table names
      if (idx > 0) & (queryTokens[idx - 1].lower() == "from") | (queryTokens[idx - 1].lower() == "join"):
        # Search through all of the table names in the database we are looking at

        # TODO: Use spacy to tag all table names using named entity recognition (NER).
        for jdx, tableName in enumerate(schemas[iquery['db_id']].tableNames):
           # If the table names match, indicate it in tablesArray
           if tableName.lower() == queryToken.lower():
              tablesArray[jdx] = 1
   
   tables.append(tablesArray)
   print(tablesArray)
   #print(schemas[iquery['db_id']].id)
   print(iquery['query_toks'])

Schema 0 : perpetrator : ['perpetrator', 'people']
Schema 1 : college_2 : ['classroom', 'department', 'course', 'instructor', 'section', 'teaches', 'student', 'takes', 'advisor', 'time_slot', 'prereq']
Schema 2 : flight_company : ['airport', 'operate_company', 'flight']
Schema 3 : icfp_1 : ['Inst', 'Authors', 'Papers', 'Authorship']
Schema 4 : body_builder : ['body_builder', 'people']
Schema 5 : storm_record : ['storm', 'region', 'affected_region']
Schema 6 : pilot_record : ['aircraft', 'pilot', 'pilot_record']
Schema 7 : race_track : ['race', 'track']
Schema 8 : academic : ['author', 'conference', 'domain', 'domain_author', 'domain_conference', 'journal', 'domain_journal', 'keyword', 'domain_keyword', 'publication', 'domain_publication', 'organization', 'publication_keyword', 'writes', 'cite']
Schema 9 : department_store : ['Addresses', 'Staff', 'Suppliers', 'Department_Store_Chain', 'Customers', 'Products', 'Supplier_Addresses', 'Customer_Addresses', 'Customer_Orders', 'Department_Stores', 'Departments', 'Order_Items', 'Product_Suppliers', 'Staff_Department_Assignments']
Schema 10 : music_4 : ['artist', 'volume', 'music_festival']
Schema 11 : insurance_fnol : ['Customers', 'Services', 'Available_Policies', 'Customers_Policies', 'First_Notification_of_Loss', 'Claims', 'Settlements']
Schema 12 : cinema : ['film', 'cinema', 'schedule']
Schema 13 : decoration_competition : ['college', 'member', 'round']
Schema 14 : phone_market : ['phone', 'market', 'phone_market']
Schema 15 : store_product : ['product', 'store', 'district', 'store_product', 'store_district']
Schema 16 : assets_maintenance : ['Third_Party_Companies', 'Maintenance_Contracts', 'Parts', 'Skills', 'Staff', 'Assets', 'Asset_Parts', 'Maintenance_Engineers', 'Engineer_Skills', 'Fault_Log', 'Engineer_Visits', 'Part_Faults', 'Fault_Log_Parts', 'Skills_Required_To_Fix']
Schema 17 : student_assessment : ['Addresses', 'People', 'Students', 'Courses', 'People_Addresses', 'Student_Course_Registrations', 'Student_Course_Attendance', 'Candidates', 'Candidate_Assessments']
Schema 18 : dog_kennels : ['Breeds', 'Charges', 'Sizes', 'Treatment_Types', 'Owners', 'Dogs', 'Professionals', 'Treatments']
Schema 19 : music_1 : ['genre', 'artist', 'files', 'song']
Schema 20 : company_employee : ['people', 'company', 'employment']
Schema 21 : farm : ['city', 'farm', 'farm_competition', 'competition_record']
Schema 22 : solvency_ii : ['Addresses', 'Locations', 'Products', 'Parties', 'Assets', 'Channels', 'Finances', 'Events', 'Products_in_Events', 'Parties_in_Events', 'Agreements', 'Assets_in_Events']
Schema 23 : city_record : ['city', 'match', 'temperature', 'hosting_city']
Schema 24 : swimming : ['swimmer', 'stadium', 'event', 'record']
Schema 25 : flight_2 : ['airlines', 'airports', 'flights']
Schema 26 : election : ['county', 'party', 'election']
Schema 27 : manufactory_1 : ['Manufacturers', 'Products']
Schema 28 : debate : ['people', 'debate', 'debate_people']
Schema 29 : network_2 : ['Person', 'PersonFriend']
Schema 30 : local_govt_in_alabama : ['Services', 'Participants', 'Events', 'Participants_in_Events']
Schema 31 : climbing : ['mountain', 'climber']
Schema 32 : e_learning : ['Course_Authors_and_Tutors', 'Students', 'Subjects', 'Courses', 'Student_Course_Enrolment', 'Student_Tests_Taken']
Schema 33 : scientist_1 : ['Scientists', 'Projects', 'AssignedTo']
Schema 34 : ship_1 : ['captain', 'Ship']
Schema 35 : entertainment_awards : ['festival_detail', 'artwork', 'nomination']
Schema 36 : allergy_1 : ['Allergy_Type', 'Has_Allergy', 'Student']
Schema 37 : imdb : ['actor', 'copyright', 'cast', 'genre', 'classification', 'company', 'director', 'producer', 'directed_by', 'keyword', 'made_by', 'movie', 'tags', 'tv_series', 'writer', 'written_by']
Schema 38 : products_for_hire : ['Discount_Coupons', 'Customers', 'Bookings', 'Products_for_Hire', 'Payments', 'Products_Booked', 'View_Product_Availability']
Schema 39 : candidate_poll : ['candidate', 'people']
Schema 40 : chinook_1 : ['Album', 'Artist', 'Customer', 'Employee', 'Genre', 'Invoice', 'InvoiceLine', 'MediaType', 'Playlist', 'PlaylistTrack', 'Track']
Schema 41 : flight_4 : ['routes', 'airports', 'airlines']
Schema 42 : pets_1 : ['Student', 'Has_Pet', 'Pets']
Schema 43 : dorm_1 : ['Student', 'Dorm', 'Dorm_amenity', 'Has_amenity', 'Lives_in']
Schema 44 : journal_committee : ['journal', 'editor', 'journal_committee']
Schema 45 : flight_1 : ['flight', 'aircraft', 'employee', 'certificate']
Schema 46 : medicine_enzyme_interaction : ['medicine', 'enzyme', 'medicine_enzyme_interaction']
Schema 47 : local_govt_and_lot : ['Customers', 'Properties', 'Residents', 'Organizations', 'Services', 'Residents_Services', 'Things', 'Customer_Events', 'Customer_Event_Notes', 'Timed_Status_of_Things', 'Timed_Locations_of_Things']
Schema 48 : station_weather : ['train', 'station', 'route', 'weekly_weather']
Schema 49 : shop_membership : ['member', 'branch', 'membership_register_branch', 'purchase']
Schema 50 : driving_school : ['Addresses', 'Staff', 'Vehicles', 'Customers', 'Customer_Payments', 'Lessons']
Schema 51 : concert_singer : ['stadium', 'singer', 'concert', 'singer_in_concert']
Schema 52 : music_2 : ['Songs', 'Albums', 'Band', 'Instruments', 'Performance', 'Tracklists', 'Vocals']
Schema 53 : sports_competition : ['club', 'club_rank', 'player', 'competition', 'competition_result']
Schema 54 : railway : ['railway', 'train', 'manager', 'railway_manage']
Schema 55 : inn_1 : ['Rooms', 'Reservations']
Schema 56 : museum_visit : ['museum', 'visitor', 'visit']
Schema 57 : browser_web : ['Web_client_accelerator', 'browser', 'accelerator_compatible_browser']
Schema 58 : baseball_1 : ['all_star', 'appearances', 'manager_award', 'player_award', 'manager_award_vote', 'player_award_vote', 'batting', 'batting_postseason', 'player_college', 'fielding', 'fielding_outfield', 'fielding_postseason', 'hall_of_fame', 'home_game', 'manager', 'manager_half', 'player', 'park', 'pitching', 'pitching_postseason', 'salary', 'college', 'postseason', 'team', 'team_franchise', 'team_half']
Schema 59 : architecture : ['architect', 'bridge', 'mill']
Schema 60 : csu_1 : ['Campuses', 'csu_fees', 'degrees', 'discipline_enrollments', 'enrollments', 'faculty']
Schema 61 : tracking_orders : ['Customers', 'Invoices', 'Orders', 'Products', 'Order_Items', 'Shipments', 'Shipment_Items']
Schema 62 : insurance_policies : ['Customers', 'Customer_Policies', 'Claims', 'Settlements', 'Payments']
Schema 63 : gas_company : ['company', 'gas_station', 'station_company']
Schema 64 : e_government : ['Addresses', 'Services', 'Forms', 'Individuals', 'Organizations', 'Parties', 'Organization_Contact_Individuals', 'Party_Addresses', 'Party_Forms', 'Party_Services']
Schema 65 : school_bus : ['driver', 'school', 'school_bus']
Schema 66 : machine_repair : ['repair', 'machine', 'technician', 'repair_assignment']
Schema 67 : theme_gallery : ['artist', 'exhibition', 'exhibition_record']
Schema 68 : film_rank : ['film', 'market', 'film_market_estimation']
Schema 69 : party_people : ['region', 'party', 'member', 'party_events']
Schema 70 : hospital_1 : ['Physician', 'Department', 'Affiliated_With', 'Procedures', 'Trained_In', 'Patient', 'Nurse', 'Appointment', 'Medication', 'Prescribes', 'Block', 'Room', 'On_Call', 'Stay', 'Undergoes']
Schema 71 : customers_campaigns_ecommerce : ['Premises', 'Products', 'Customers', 'Mailshot_Campaigns', 'Customer_Addresses', 'Customer_Orders', 'Mailshot_Customers', 'Order_Items']
Schema 72 : gymnast : ['gymnast', 'people']
Schema 73 : restaurants : ['GEOGRAPHIC', 'RESTAURANT', 'LOCATION']
Schema 74 : mountain_photos : ['mountain', 'camera_lens', 'photos']
Schema 75 : battle_death : ['battle', 'ship', 'death']
Schema 76 : cre_Doc_Control_Systems : ['Ref_Document_Types', 'Roles', 'Addresses', 'Ref_Document_Status', 'Ref_Shipping_Agents', 'Documents', 'Employees', 'Document_Drafts', 'Draft_Copies', 'Circulation_History', 'Documents_Mailed']
Schema 77 : tracking_share_transactions : ['Investors', 'Lots', 'Ref_Transaction_Types', 'Transactions', 'Sales', 'Purchases', 'Transactions_Lots']
Schema 78 : apartment_rentals : ['Apartment_Buildings', 'Apartments', 'Apartment_Facilities', 'Guests', 'Apartment_Bookings', 'View_Unit_Status']
Schema 79 : student_transcripts_tracking : ['Addresses', 'Courses', 'Departments', 'Degree_Programs', 'Sections', 'Semesters', 'Students', 'Student_Enrolment', 'Student_Enrolment_Courses', 'Transcripts', 'Transcript_Contents']
Schema 80 : cre_Docs_and_Epenses : ['Ref_Document_Types', 'Ref_Budget_Codes', 'Projects', 'Documents', 'Statements', 'Documents_with_Expenses', 'Accounts']
Schema 81 : ship_mission : ['mission', 'ship']
Schema 82 : company_office : ['buildings', 'Companies', 'Office_locations']
Schema 83 : tracking_software_problems : ['Problem_Category_Codes', 'Problem_Log', 'Problem_Status_Codes', 'Product', 'Staff', 'Problems']
Schema 84 : products_gen_characteristics : ['Ref_Characteristic_Types', 'Ref_Colors', 'Ref_Product_Categories', 'Characteristics', 'Products', 'Product_Characteristics']
Schema 85 : coffee_shop : ['shop', 'member', 'happy_hour', 'happy_hour_member']
Schema 86 : riding_club : ['player', 'club', 'coach', 'player_coach', 'match_result']
Schema 87 : customers_card_transactions : ['Accounts', 'Customers', 'Customers_Cards', 'Financial_Transactions']
Schema 88 : county_public_safety : ['county_public_safety', 'city']
Schema 89 : performance_attendance : ['member', 'performance', 'member_attendance']
Schema 90 : club_1 : ['Student', 'Club', 'Member_of_club']
Schema 91 : singer : ['singer', 'song']
Schema 92 : culture_company : ['book_club', 'movie', 'culture_company']
Schema 93 : cre_Doc_Template_Mgt : ['Ref_Template_Types', 'Templates', 'Documents', 'Paragraphs']
Schema 94 : musical : ['musical', 'actor']
Schema 95 : world_1 : ['city', 'sqlite_sequence', 'country', 'countrylanguage']
Schema 96 : device : ['device', 'shop', 'stock']
Schema 97 : tracking_grants_for_research : ['Document_Types', 'Documents', 'Grants', 'Organisation_Types', 'Organisations', 'Project_Outcomes', 'Project_Staff', 'Projects', 'Research_Outcomes', 'Research_Staff', 'Staff_Roles', 'Tasks']
Schema 98 : employee_hire_evaluation : ['employee', 'shop', 'hiring', 'evaluation']
Schema 99 : movie_1 : ['Movie', 'Reviewer', 'Rating']
Schema 100 : network_1 : ['Highschooler', 'Friend', 'Likes']
Schema 101 : poker_player : ['poker_player', 'people']
Schema 102 : program_share : ['program', 'channel', 'broadcast', 'broadcast_share']
Schema 103 : aircraft : ['pilot', 'aircraft', 'match', 'airport', 'airport_aircraft']
Schema 104 : restaurant_1 : ['Student', 'Restaurant', 'Type_Of_Restaurant', 'Restaurant_Type', 'Visits_Restaurant']
Schema 105 : customers_and_invoices : ['Customers', 'Orders', 'Invoices', 'Accounts', 'Product_Categories', 'Products', 'Financial_Transactions', 'Order_Items', 'Invoice_Line_Items']
Schema 106 : insurance_and_eClaims : ['Customers', 'Staff', 'Policies', 'Claim_Headers', 'Claims_Documents', 'Claims_Processing_Stages', 'Claims_Processing']
Schema 107 : college_1 : ['CLASS', 'COURSE', 'DEPARTMENT', 'EMPLOYEE', 'ENROLL', 'PROFESSOR', 'STUDENT']
Schema 108 : local_govt_mdm : ['Customer_Master_Index', 'CMI_Cross_References', 'Council_Tax', 'Business_Rates', 'Benefits_Overpayments', 'Parking_Fines', 'Rent_Arrears', 'Electoral_Register']
Schema 109 : book_2 : ['publication', 'book']
Schema 110 : hr_1 : ['regions', 'countries', 'departments', 'jobs', 'employees', 'job_history', 'locations']
Schema 111 : soccer_1 : ['Player_Attributes', 'sqlite_sequence', 'Player', 'League', 'Country', 'Team', 'Team_Attributes']
Schema 112 : sakila_1 : ['actor', 'address', 'category', 'city', 'country', 'customer', 'film', 'film_actor', 'film_category', 'film_text', 'inventory', 'language', 'payment', 'rental', 'staff', 'store']
Schema 113 : real_estate_properties : ['Ref_Feature_Types', 'Ref_Property_Types', 'Other_Available_Features', 'Properties', 'Other_Property_Features']
Schema 114 : college_3 : ['Student', 'Faculty', 'Department', 'Member_of', 'Course', 'Minor_in', 'Enrolled_in', 'Gradeconversion']
Schema 115 : course_teach : ['course', 'teacher', 'course_arrange']
Schema 116 : roller_coaster : ['roller_coaster', 'country']
Schema 117 : customer_deliveries : ['Products', 'Addresses', 'Customers', 'Regular_Orders', 'Regular_Order_Products', 'Actual_Orders', 'Actual_Order_Products', 'Customer_Addresses', 'Delivery_Routes', 'Delivery_Route_Locations', 'Trucks', 'Employees', 'Order_Deliveries']
Schema 118 : game_injury : ['stadium', 'game', 'injury_accident']
Schema 119 : school_finance : ['School', 'budget', 'endowment']
Schema 120 : scholar : ['venue', 'author', 'dataset', 'journal', 'keyphrase', 'paper', 'cite', 'paperDataset', 'paperKeyphrase', 'writes']
Schema 121 : voter_1 : ['AREA_CODE_STATE', 'CONTESTANTS', 'VOTES']
Schema 122 : match_season : ['country', 'team', 'match_season', 'player']
Schema 123 : small_bank_1 : ['ACCOUNTS', 'SAVINGS', 'CHECKING']
Schema 124 : wta_1 : ['players', 'matches', 'rankings']
Schema 125 : yelp : ['business', 'category', 'user', 'checkin', 'neighbourhood', 'review', 'tip']
Schema 126 : student_1 : ['list', 'teachers']
Schema 127 : manufacturer : ['manufacturer', 'furniture', 'furniture_manufacte']
Schema 128 : store_1 : ['artists', 'sqlite_sequence', 'albums', 'employees', 'customers', 'genres', 'invoices', 'media_types', 'tracks', 'invoice_lines', 'playlists', 'playlist_tracks']
Schema 129 : train_station : ['station', 'train', 'train_station']
Schema 130 : document_management : ['Roles', 'Users', 'Document_Structures', 'Functional_Areas', 'Images', 'Documents', 'Document_Functional_Areas', 'Document_Sections', 'Document_Sections_Images']
Schema 131 : formula_1 : ['circuits', 'races', 'drivers', 'status', 'seasons', 'constructors', 'constructorStandings', 'results', 'driverStandings', 'constructorResults', 'qualifying', 'pitStops', 'lapTimes']
Schema 132 : game_1 : ['Student', 'Video_Games', 'Plays_Games', 'SportsInfo']
Schema 133 : loan_1 : ['bank', 'customer', 'loan']
Schema 134 : bike_1 : ['station', 'status', 'trip', 'weather']
Schema 135 : entrepreneur : ['entrepreneur', 'people']
Schema 136 : orchestra : ['conductor', 'orchestra', 'performance', 'show']
Schema 137 : cre_Drama_Workshop_Groups : ['Ref_Payment_Methods', 'Ref_Service_Types', 'Addresses', 'Products', 'Marketing_Regions', 'Clients', 'Drama_Workshop_Groups', 'Performers', 'Customers', 'Stores', 'Bookings', 'Performers_in_Bookings', 'Customer_Orders', 'Order_Items', 'Invoices', 'Services', 'Bookings_Services', 'Invoice_Items']
Schema 138 : car_1 : ['continents', 'countries', 'car_makers', 'model_list', 'car_names', 'cars_data']
Schema 139 : geo : ['state', 'city', 'border_info', 'highlow', 'lake', 'mountain', 'river']
Schema 140 : behavior_monitoring : ['Ref_Address_Types', 'Ref_Detention_Type', 'Ref_Incident_Type', 'Addresses', 'Students', 'Teachers', 'Assessment_Notes', 'Behavior_Incident', 'Detention', 'Student_Addresses', 'Students_in_Detention']
Schema 141 : cre_Doc_Tracking_DB : ['Ref_Document_Types', 'Ref_Calendar', 'Ref_Locations', 'Roles', 'All_Documents', 'Employees', 'Document_Locations', 'Documents_to_be_Destroyed']
Schema 142 : university_basketball : ['basketball_match', 'university']
Schema 143 : soccer_2 : ['College', 'Player', 'Tryout']
Schema 144 : activity_1 : ['Activity', 'Participates_in', 'Faculty_Participates_in', 'Student', 'Faculty']
Schema 145 : cre_Theme_park : ['Ref_Hotel_Star_Ratings', 'Locations', 'Ref_Attraction_Types', 'Visitors', 'Features', 'Hotels', 'Tourist_Attractions', 'Street_Markets', 'Shops', 'Museums', 'Royal_Family', 'Theme_Parks', 'Visits', 'Photos', 'Staff', 'Tourist_Attraction_Features']
Schema 146 : twitter_1 : ['follows', 'tweets', 'user_profiles']
Schema 147 : election_representative : ['election', 'representative']
Schema 148 : voter_2 : ['Student', 'Voting_record']
Schema 149 : wedding : ['people', 'church', 'wedding']
Schema 150 : news_report : ['event', 'journalist', 'news_report']
Schema 151 : wine_1 : ['grapes', 'appellations', 'wine']
Schema 152 : customers_and_addresses : ['Addresses', 'Products', 'Customers', 'Customer_Addresses', 'Customer_Contact_Channels', 'Customer_Orders', 'Order_Items']
Schema 153 : protein_institute : ['building', 'Institution', 'protein']
Schema 154 : school_player : ['school', 'school_details', 'school_performance', 'player']
Schema 155 : phone_1 : ['chip_model', 'screen_mode', 'phone']
Schema 156 : tvshow : ['TV_Channel', 'TV_series', 'Cartoon']
Schema 157 : wrestler : ['wrestler', 'Elimination']
Schema 158 : customer_complaints : ['Staff', 'Customers', 'Products', 'Complaints']
Schema 159 : department_management : ['department', 'head', 'management']
Schema 160 : customers_and_products_contacts : ['Addresses', 'Products', 'Customers', 'Contacts', 'Customer_Address_History', 'Customer_Orders', 'Order_Items']
Schema 161 : company_1 : ['works_on', 'employee', 'department', 'project', 'dependent', 'dept_locations']
Schema 162 : workshop_paper : ['workshop', 'submission', 'Acceptance']
Schema 163 : epinions_1 : ['item', 'review', 'useracct', 'trust']
Schema 164 : party_host : ['party', 'host', 'party_host']
Schema 165 : product_catalog : ['Attribute_Definitions', 'Catalogs', 'Catalog_Structure', 'Catalog_Contents', 'Catalog_Contents_Additional_Attributes']
[0, 1, 0]
['SELECT', 'count', '(', '*', ')', 'FROM', 'head', 'WHERE', 'age', '>', '56']
[0, 1, 0]
['SELECT', 'name', ',', 'born_state', ',', 'age', 'FROM', 'head', 'ORDER', 'BY', 'age']
[1, 0, 0]
['SELECT', 'creation', ',', 'name', ',', 'budget_in_billions', 'FROM', 'department']
[1, 0, 0]
['SELECT', 'max', '(', 'budget_in_billions', ')', ',', 'min', '(', 'budget_in_billions', ')', 'FROM', 'department']
[1, 0, 0]
['SELECT', 'avg', '(', 'num_employees', ')', 'FROM', 'department', 'WHERE', 'ranking', 'BETWEEN', '10', 'AND', '15']
[0, 1, 0]
['SELECT', 'name', 'FROM', 'head', 'WHERE', 'born_state', '!', '=', "'California", "'"]
[1, 1, 1]
['SELECT', 'DISTINCT', 'T1.creation', 'FROM', 'department', 'AS', 'T1', 'JOIN', 'management', 'AS', 'T2', 'ON', 'T1.department_id', '=', 'T2.department_id', 'JOIN', 'head', 'AS', 'T3', 'ON', 'T2.head_id', '=', 'T3.head_id', 'WHERE', 'T3.born_state', '=', "'Alabama", "'"]
[0, 1, 0]
['SELECT', 'born_state', 'FROM', 'head', 'GROUP', 'BY', 'born_state', 'HAVING', 'count', '(', '*', ')', '>', '=', '3']
[1, 0, 0]
['SELECT', 'creation', 'FROM', 'department', 'GROUP', 'BY', 'creation', 'ORDER', 'BY', 'count', '(', '*', ')', 'DESC', 'LIMIT', '1']
[1, 0, 1]
['SELECT', 'T1.name', ',', 'T1.num_employees', 'FROM', 'department', 'AS', 'T1', 'JOIN', 'management', 'AS', 'T2', 'ON', 'T1.department_id', '=', 'T2.department_id', 'WHERE', 'T2.temporary_acting', '=', "'Yes", "'"]
[0, 0, 1]
['SELECT', 'count', '(', 'DISTINCT', 'temporary_acting', ')', 'FROM', 'management']
[1, 0, 1]
['SELECT', 'count', '(', '*', ')', 'FROM', 'department', 'WHERE', 'department_id', 'NOT', 'IN', '(', 'SELECT', 'department_id', 'FROM', 'management', ')', ';']
[0, 1, 1]
['SELECT', 'DISTINCT', 'T1.age', 'FROM', 'management', 'AS', 'T2', 'JOIN', 'head', 'AS', 'T1', 'ON', 'T1.head_id', '=', 'T2.head_id', 'WHERE', 'T2.temporary_acting', '=', "'Yes", "'"]
[1, 1, 1]
['SELECT', 'T3.born_state', 'FROM', 'department', 'AS', 'T1', 'JOIN', 'management', 'AS', 'T2', 'ON', 'T1.department_id', '=', 'T2.department_id', 'JOIN', 'head', 'AS', 'T3', 'ON', 'T2.head_id', '=', 'T3.head_id', 'WHERE', 'T1.name', '=', "'Treasury", "'", 'INTERSECT', 'SELECT', 'T3.born_state', 'FROM', 'department', 'AS', 'T1', 'JOIN', 'management', 'AS', 'T2', 'ON', 'T1.department_id', '=', 'T2.department_id', 'JOIN', 'head', 'AS', 'T3', 'ON', 'T2.head_id', '=', 'T3.head_id', 'WHERE', 'T1.name', '=', "'Homeland", 'Security', "'"]
[1, 0, 1]

In [5]:
def loadTrainDF(inputLines):
    wordSense = 0
    questions = []
    tables = []

    for line in inputLines:
        if line == "1\n":
            wordSense = 1
        elif line == "2\n":
            wordSense = 2
        elif (line != "\n") & (wordSense != 0):
            lines.append(line.strip())
            senses.append(wordSense)
    trainDF = pd.DataFrame(data={'text': lines,'sense': senses})
    trainDF['classification'] = trainDF['sense'].apply(lambda x: x - 1)
    return trainDF

In [ ]:
def get_sentence_embeddings(bert_preprocess_model, bert_encoder_model, sentences = []):
    
    text_preprocessed = bert_preprocess_model(sentences)
    return bert_encoder_model(text_preprocessed)['pooled_output']

In [ ]:
# Code Adopted and modified from YouTube video: https://www.youtube.com/watch?v=7kLi8u2dJz0&t=719s
preprocess_url = 'https://tfhub.dev/tensorflow/bert_en_uncased_preprocess/3'
encoder_url = 'https://tfhub.dev/tensorflow/bert_en_uncased_L-12_H-768_A-12/4'

In [ ]:
bert_preprocess_model = hub.KerasLayer(preprocess_url)
bert_model = hub.KerasLayer(encoder_url)

In [ ]:
# ! Code Adopted and Modified from https://github.com/eclarson/MachineLearningNotebooks and https://www.youtube.com/watch?v=hOCDJyZ6quA
# Notebook 13: RNN Basics
from tensorflow.keras.layers import Dense, LSTM, Dropout, Input

# BERT Layers
text_input = tf.keras.layers.Input(shape=(), dtype=tf.string, name="text")
preprocessed_text = bert_preprocess_model(text_input)
outputs = bert_model(preprocessed_text)

# NN Layers
l = tf.keras.layers.Dropout(0.2, name="dropout")(outputs['pooled_output'])
l = tf.keras.layers.Dense(1, activation='sigmoid', name='output')(l)

# Final Model
model = tf.keras.Model(inputs=[text_input], outputs=[l])

METRICS = [
    tf.keras.metrics.BinaryAccuracy(name='accuracy'),
    tf.keras.metrics.Precision(name='precision'),
    tf.keras.metrics.Recall(name='recall')
]

model.compile(optimizer='adam', loss='binary_crossentropy', metrics=METRICS)

In [ ]:
model.fit(X_train, y_train, epochs=3)
model.save('rubbish')

In [ ]:
rubbish_model = tf.keras.models.load_model('rubbish')

In [ ]:
import nltk
import numpy as np
import pandas as pd
import tensorflow as tf

stopWordSet = nltk.corpus.stopwords.words('english')
stemmer = nltk.SnowballStemmer(language='english')
tokenizer = nltk.RegexpTokenizer(r"[a-zA-Z0-9]+")

def getTestData(inputfile):
    wordSense = 0
    lines = []
    senses = []

    for line in inputLines:
        if line == "1\n":
            wordSense = 1
        elif line == "2\n":
            wordSense = 2
        elif (line != "\n") & (wordSense != 0):
            lines.append(line.strip())
            senses.append(wordSense)
    trainDF = pd.DataFrame(data={'text': lines,'sense': senses})
    return trainDF

rubbishTestInput = open("testing/rubbish.txt", "r", encoding='utf-8')

lines = rubbishTestInput.readlines()
linesStripped = np.asarray([line.strip() for line in lines])

rubbish_predictions = rubbish_model.predict(linesStripped)
print(rubbish_predictions)

output_file = open('results/result_rubbish_Michael_Lennon.txt', "w", encoding='utf-8')

for prediction in rubbish_predictions:
    if prediction > 0.5:
        output_file.write('2\n')
    else:
        output_file.write('1\n')


# Rubbish Model.train()
rubbishTestInput.close()
output_file.close()